In [2]:
import pandas as pd

In [3]:
s1=pd.Series(['a','b','c'])

In [4]:
s1

0    a
1    b
2    c
dtype: object

In [5]:
s2=pd.Series(['d','e','f'])

In [6]:
s2

0    d
1    e
2    f
dtype: object

In [7]:
s1=pd.Series(['a','b','c'],index=[1,2,3])

In [8]:
s2=pd.Series(['d','e','f'],index=[4,5,6])

In [9]:
pd.concat([s1,s2])

1    a
2    b
3    c
4    d
5    e
6    f
dtype: object

In [14]:
df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
					'Name1': ['ABC', 'PQR', 'DEF', 'GHI']})

In [15]:
df2 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
					'Name2': ['ABC', 'PQR', 'DEF', 'GHI']})

In [16]:
df1

    id Name1
0  A01   ABC
1  A02   PQR
2  A03   DEF
3  A04   GHI

In [17]:
df2

    id Name2
0  A01   ABC
1  A02   PQR
2  A03   DEF
3  A04   GHI

In [18]:
pd.concat([df1,df2])

    id Name1 Name2
0  A01   ABC   NaN
1  A02   PQR   NaN
2  A03   DEF   NaN
3  A04   GHI   NaN
0  A01   NaN   ABC
1  A02   NaN   PQR
2  A03   NaN   DEF
3  A04   NaN   GHI

In [19]:
pd.concat([df1,df2] ,join='inner')

    id
0  A01
1  A02
2  A03
3  A04
0  A01
1  A02
2  A03
3  A04

In [20]:
# Re-importing pandas after code execution state reset
import pandas as pd

# Re-creating the initial DataFrame
books_df = pd.DataFrame({
    'Title': ['To Kill a Mockingbird', '1984', 'The Great Gatsby'],
    'Author': ['Harper Lee', 'George Orwell', 'F. Scott Fitzgerald']
})

# New data to append (as dictionaries)
new_book_1 = {'Title': 'The Catcher in the Rye', 'Author': 'J.D. Salinger'}
new_book_2 = {'Title': 'The Hobbit', 'Author': 'J.R.R. Tolkien'}

# Append new data to the DataFrame
updated_books_df = books_df.append([new_book_1, new_book_2], ignore_index=True)

updated_books_df

AttributeError: 'DataFrame' object has no attribute 'append'